---
layout: post
title: "Breaking Minesweeper: The mimikatz Way"
categories:
- Reverse Engineering
tags:
- Rust
- WinDbg
author: zodi4c
img_path: "/assets/img/minesweeper/"
image: win7_mimikatz.png
date: 2023-07-13 18:21 +0100
---
In this post, we will discuss how the Minesweeper module of `mimikatz` is implemented and code our own version in Rust. The finished crate can be found in the [`mimisweep`](https://github.com/zodi4cx/mimisweep) repository.

## Motivation

I recently picked up the Rust programming language, and I've been looking for interesting projects to implement using the language. While I've been developing some small crates with simple functionality, I felt like I was prepared to tackle a more ambitious project — maybe the development of a tool that could be useful for real-world Red Team engagements.

As I was browsing projects on GitHub for inspiration, I remembered a piece of advise that I had never actually put to the test:

> Re-implement the tools that you commonly use to better understand its underlying functionality.
{: .prompt-tip }


We are now equipped with all the knowledge necessary to port the code in charge of retrieving the PEB to Rust. Let's start backwards, beginning with the copy functionality.

> We will simplify, and assume that the destination will always be our own process, as this is the case in the majority of the `mimikatz` codebase.
{: .prompt-info }

```rust
pub unsafe fn copy<T>(source: &MemoryHandle, data_ptr: *const T) -> Result<T> {
    match source {
        MemoryHandle::Process(handle) => read_from_process(*handle, data_ptr),
        _ => unimplemented!("copy not implemented for {:?}", source),
    }
}
```
{: file="memory.rs"}

This function will act as a wrapper for the actual code that performs the copy, allowing us to match the value of the source `MemoryHandle` to the correct specific operation. Now, we need to write down the `read_from_process` function. Luckily, while searching documentation on how to properly use the `ReadProcessMemory` API in Rust, I came across a [Mozilla library](https://hg.mozilla.org/mozilla-central/file/tip/toolkit/crashreporter/mozwer-rust/lib.rs) that does exactly what we want. I re-adapted the error management to fit our needs, ending up with the following function:

```rust
unsafe fn read_from_process<T>(process: HANDLE, data_ptr: *const T) -> Result<T> {
    let mut data: T = mem::zeroed();
    unsafe {
        ReadProcessMemory(
            process,
            data_ptr as *mut _,
            addr_of_mut!(data) as *mut _,
            mem::size_of::<T>(),
            None,
        )
    }
    .as_bool()
    .then_some(data)
    .ok_or(anyhow!("error reading memory of remote process"))
}
```
{: file="memory.rs"}

We can now read data structures from a remote process! As we will be reading the PEB, let's define a data structure with the relevant fields that we may use. The MSDN documentation defines the PEB structure as follows:

```c
typedef struct _PEB {
  BYTE                          Reserved1[2];
  BYTE                          BeingDebugged;
  BYTE                          Reserved2[1];
  PVOID                         Reserved3[2];
  PPEB_LDR_DATA                 Ldr;
  PRTL_USER_PROCESS_PARAMETERS  ProcessParameters;
  PVOID                         Reserved4[3];
  PVOID                         AtlThunkSListPtr;
  PVOID                         Reserved5;
  ULONG                         Reserved6;
  PVOID                         Reserved7;
  ULONG                         Reserved8;
  ULONG                         AtlThunkSListPtr32;
  PVOID                         Reserved9[45];
  BYTE                          Reserved10[96];
  PPS_POST_PROCESS_INIT_ROUTINE PostProcessInitRoutine;
  BYTE                          Reserved11[128];
  PVOID                         Reserved12[1];
  ULONG                         SessionId;
} PEB, *PPEB;
```

Unluckily, this description is not very helpful, as this structure is only meant to be used for internal development. We do, however, get a more descriptive definition if we query WinDbg for the definition of `ntdll!_PEB`:

```
0:001> dt _PEB
ntdll!_PEB
   +0x000 InheritedAddressSpace : UChar
   +0x001 ReadImageFileExecOptions : UChar
   +0x002 BeingDebugged    : UChar
   +0x003 BitField         : UChar
   +0x003 ImageUsesLargePages : Pos 0, 1 Bit
   +0x003 IsProtectedProcess : Pos 1, 1 Bit
   +0x003 IsImageDynamicallyRelocated : Pos 2, 1 Bit
   +0x003 SkipPatchingUser32Forwarders : Pos 3, 1 Bit
   +0x003 IsPackagedProcess : Pos 4, 1 Bit
   +0x003 IsAppContainer   : Pos 5, 1 Bit
   +0x003 IsProtectedProcessLight : Pos 6, 1 Bit
   +0x003 IsLongPathAwareProcess : Pos 7, 1 Bit
   +0x004 Mutant           : Ptr32 Void
   +0x008 ImageBaseAddress : Ptr32 Void
   +0x00c Ldr              : Ptr32 _PEB_LDR_DATA
   +0x010 ProcessParameters : Ptr32 _RTL_USER_PROCESS_PARAMETERS
   ...
```

This description matches with the struct defined in `kull_m_process.h`{: .filepath }. Using WinDbg's symbols for developing a better understanding of how an undescriptive piece of software works will prove to be very useful once again in a few sections. For now, however, let's implement this structure:

```rust
#[repr(C)]
pub struct Peb {
    pub inherited_address_space: u8,
    pub read_image_file_exec_options: u8,
    pub being_debugged: u8,
    pub bit_field: BitField,
    pub mutant: HANDLE,
    pub image_base_address: *mut c_void,
    pub ldr: *mut PEB_LDR_DATA,
    pub process_parameters: *mut RTL_USER_PROCESS_PARAMETERS,
    // ...
}

#[repr(C)]
pub struct BitField {
    pub image_uses_large_pages: u8,
    pub spare_bits: u8,
}
```
{: file="process.rs"}

